Documents/ОтборРазмещениеТоваровBabochka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтборРазмещениеТоваровBabochka</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтбораРазмещенияТоваровBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтборовРазмещенийТоваровBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаявкаНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыОтбор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НеОтображатьДвижения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыРазмещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусАдресноеХранение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтборовРазмещенийТоваровBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтборРазмещениеТоваровBabochka/Ext/ObjectModule.bsl
Функция ЗаполнитьПараметрыДокументаПеремещение(ЭтотОбъект, ДанныеЗаполнения)
	
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Перемещение;
	ЭтотОбъект.ЗонаПриемки = АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад);//Константы.АХ_ЗонаПриемки.Получить();
	ЭтотОбъект.ЗонаОтгрузки = АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад);//Константы.АХ_ЗонаОтгрузки.Получить();
	ЭтотОбъект.Распоряжение = ДанныеЗаполнения;
	ЭтотОбъект.Склад = ДанныеЗаполнения.Склад;
	ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Подготовлено;
		
КонецФункции 

Функция ЗаполнитьПараметрыДокументаПриход(ЭтотОбъект, ДанныеЗаполнения)
	
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение;
	ЭтотОбъект.ЗонаПриемки = АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад);//Константы.АХ_ЗонаПриемки.Получить();
	ЭтотОбъект.Распоряжение = ДанныеЗаполнения;
	ЭтотОбъект.Склад = ДанныеЗаполнения.Склад;
	ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Подготовлено;
		
КонецФункции  

Функция ЗаполнитьПараметрыДокументаРасход(ЭтотОбъект, ДанныеЗаполнения)
	
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Отбор;
	ЭтотОбъект.ЗонаОтгрузки = АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад);//Константы.АХ_ЗонаОтгрузки.Получить();
	ЭтотОбъект.Распоряжение = ДанныеЗаполнения;
	ЭтотОбъект.Склад = ДанныеЗаполнения.Склад;
	ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Подготовлено;
		
КонецФункции


Функция ЗаполнитьЯчейки(ЭтоПриход = Истина) Экспорт

	Если ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено Тогда
		Сообщить("Невозможно выполнить изменение ячеек документа в статусе Выполнено.
				|Измените статус документа.");   
		
		Результат = Новый Структура();
		Результат.Вставить("Товары", Неопределено);
		Результат.Вставить("МассивОшибок",  Неопределено);
	
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЭтоПриход Тогда
		Результат = ЗаполнитьПриходВЯчейки();
	Иначе
		Результат = ЗаполнитьРасходВЯчейки();
	КонецЕсли;
	
	
	Возврат Результат;
		
КонецФункции

Функция ЗаполнитьПриходВЯчейки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_Товары.Количество КАК ЧИСЛО(15, 0)) КАК Количество,
		|	ВТ_Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Таблица КАК ВТ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура.НомГруппаРеквизит10 КАК ТоварнаяКатегория,
		|	ВЫБОР
		|		КОГДА ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду ЕСТЬ NULL
		|			ТОГДА &ТипЛюкс
		|		ИНАЧЕ ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду
		|	КОНЕЦ КАК ТипОтношенияКБренду,
		|	СУММА(ВТ_Товары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_КатегорииОтношение
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПринадлежностьТипаХраненияКБренду.СрезПоследних(&Период, ) КАК ПринадлежностьТипаХраненияКБрендуСрезПоследних
		|		ПО ВТ_Товары.Номенклатура.Марка = ПринадлежностьТипаХраненияКБрендуСрезПоследних.Бренд
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура.НомГруппаРеквизит10,
		|	ВЫБОР
		|		КОГДА ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду ЕСТЬ NULL
		|			ТОГДА &ТипЛюкс
		|		ИНАЧЕ ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Типоразмеры.Ссылка КАК Типоразмер,
		|	СУММА(ВТ_КатегорииОтношение.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТипоразмерыДокумента
		|ИЗ
		|	ВТ_КатегорииОтношение КАК ВТ_КатегорииОтношение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерЯчейкиBabochka.ТоварныеКатегории КАК Типоразмеры
		|		ПО ВТ_КатегорииОтношение.ТоварнаяКатегория = Типоразмеры.ТоварнаяКатегория
		|			И (НЕ Типоразмеры.Ссылка.ПометкаУдаления)
		|			И ВТ_КатегорииОтношение.ТипОтношенияКБренду = Типоразмеры.Ссылка.ОтношениеКБренду
		|ГДЕ
		|	НЕ Типоразмеры.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Типоразмеры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КатегорииОтношение.Количество КАК Количество,
		|	ВТ_КатегорииОтношение.ТоварнаяКатегория.Наименование КАК ОбъектОшибкиНаименование,
		|	ВТ_КатегорииОтношение.ТипОтношенияКБренду КАК ТипОтношенияКБренду,
		|	""Не найден типоразмер с заданной категорией и отношению к бренду: "" + ВТ_КатегорииОтношение.ТоварнаяКатегория.Наименование КАК Ошибка
		|ИЗ
		|	ВТ_КатегорииОтношение КАК ВТ_КатегорииОтношение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерЯчейкиBabochka.ТоварныеКатегории КАК Типоразмеры
		|		ПО ВТ_КатегорииОтношение.ТоварнаяКатегория = Типоразмеры.ТоварнаяКатегория
		|			И (НЕ Типоразмеры.Ссылка.ПометкаУдаления)
		|			И ВТ_КатегорииОтношение.ТипОтношенияКБренду = Типоразмеры.Ссылка.ОтношениеКБренду
		|ГДЕ
		|	Типоразмеры.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ВТ_КатегорииОтношение.Количество),
		|	Типоразмеры.Ссылка.Наименование,
		|	"""",
		|	""Отсутствуют ячейки для типоразмера "" + Типоразмеры.Ссылка.Наименование
		|ИЗ
		|	ВТ_КатегорииОтношение КАК ВТ_КатегорииОтношение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерЯчейкиBabochka.ТоварныеКатегории КАК Типоразмеры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейкиBabochka КАК СкладскиеЯчейкиBabochka
		|			ПО Типоразмеры.Ссылка = СкладскиеЯчейкиBabochka.Типоразмер
		|		ПО ВТ_КатегорииОтношение.ТоварнаяКатегория = Типоразмеры.ТоварнаяКатегория
		|			И (НЕ Типоразмеры.Ссылка.ПометкаУдаления)
		|			И ВТ_КатегорииОтношение.ТипОтношенияКБренду = Типоразмеры.Ссылка.ОтношениеКБренду
		|ГДЕ
		|	НЕ Типоразмеры.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА СкладскиеЯчейкиBabochka.Ссылка ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Типоразмеры.Ссылка.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТипоразмерыДокумента.Типоразмер КАК Типоразмер,
		|	ВТ_ТипоразмерыДокумента.Количество КАК Количество,
		|	ОстаткиВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ОстаткиВЯчейкахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиВЯчейкахОстатки.Ячейка.Код, """") КАК ЯчейкаКод
		|ИЗ
		|	ВТ_ТипоразмерыДокумента КАК ВТ_ТипоразмерыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиВЯчейках.Остатки(&Период, Ячейка.ТипСкладскойЯчейки = &ТипЯчейкиХранение) КАК ОстаткиВЯчейкахОстатки
		|		ПО ВТ_ТипоразмерыДокумента.Типоразмер = ОстаткиВЯчейкахОстатки.Ячейка.Типоразмер
		|			И (ОстаткиВЯчейкахОстатки.КоличествоОстаток > 0)
		|ГДЕ
		|	НЕ ОстаткиВЯчейкахОстатки.Ячейка ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Типоразмер,
		|	КоличествоОстаток,
		|	ЯчейкаКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_Товары.Количество) КАК Количество,
		|	ВТ_Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыГруппировка
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыГруппировка.Номенклатура КАК Номенклатура,
		|	ТоварыГруппировка.Характеристика КАК Характеристика,
		|	СУММА(ТоварыГруппировка.Количество) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(ГруппировкаТипоразмеров.Типоразмер, """")) КАК Типоразмер,
		|	ТоварыГруппировка.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	ТоварыГруппировка КАК ТоварыГруппировка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_Товары.Номенклатура КАК Номенклатура,
		|			ВТ_Товары.Характеристика КАК Характеристика,
		|			МАКСИМУМ(ВЫБОР
		|					КОГДА ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду ЕСТЬ NULL
		|						ТОГДА &ТипЛюкс
		|					ИНАЧЕ ПринадлежностьТипаХраненияКБрендуСрезПоследних.ТипОтношенияКБренду
		|				КОНЕЦ) КАК ТипОтношенияКБренду,
		|			ВТ_Товары.Номенклатура.НомГруппаРеквизит10 КАК ТоварнаяКатегория
		|		ИЗ
		|			ВТ_Товары КАК ВТ_Товары
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПринадлежностьТипаХраненияКБренду.СрезПоследних(&Период, ) КАК ПринадлежностьТипаХраненияКБрендуСрезПоследних
		|				ПО ВТ_Товары.Номенклатура.Марка = ПринадлежностьТипаХраненияКБрендуСрезПоследних.Бренд
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_Товары.Номенклатура,
		|			ВТ_Товары.Характеристика,
		|			ВТ_Товары.Номенклатура.НомГруппаРеквизит10) КАК Товары
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|				МАКСИМУМ(ТипоразмерЯчейкиBabochkaТоварныеКатегории.Ссылка) КАК Типоразмер,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.Ссылка.ОтношениеКБренду КАК ОтношениеКБренду,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.БольшаяКоробка КАК БольшаяКоробка,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.Развеска КАК Развеска
		|			ИЗ
		|				Справочник.ТипоразмерЯчейкиBabochka.ТоварныеКатегории КАК ТипоразмерЯчейкиBabochkaТоварныеКатегории
		|			ГДЕ
		|				НЕ ТипоразмерЯчейкиBabochkaТоварныеКатегории.Ссылка.ПометкаУдаления
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.ТоварнаяКатегория,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.Ссылка.ОтношениеКБренду,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.БольшаяКоробка,
		|				ТипоразмерЯчейкиBabochkaТоварныеКатегории.Развеска) КАК ГруппировкаТипоразмеров
		|			ПО Товары.ТипОтношенияКБренду = ГруппировкаТипоразмеров.ОтношениеКБренду
		|				И Товары.ТоварнаяКатегория = ГруппировкаТипоразмеров.ТоварнаяКатегория
		|				И Товары.Номенклатура.БольшаяКоробка = ГруппировкаТипоразмеров.БольшаяКоробка
		|				И Товары.Номенклатура.Развеска = ГруппировкаТипоразмеров.Развеска
		|		ПО ТоварыГруппировка.Номенклатура = Товары.Номенклатура
		|			И ТоварыГруппировка.Характеристика = Товары.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыГруппировка.Номенклатура,
		|	ТоварыГруппировка.Характеристика,
		|	ТоварыГруппировка.Номенклатура.ИспользованиеХарактеристик";
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Период", Новый МоментВремени(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка));
	Иначе
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипЯчейкиХранение", Перечисления.ТипыСкладскихЯчеек.Хранение);
	Запрос.УстановитьПараметр("Таблица", ЭтотОбъект["ТоварыРазмещение"].Выгрузить(,"Номенклатура,Характеристика,Количество"));
	Запрос.УстановитьПараметр("ТипЛюкс", Перечисления.ТипыХраненияПоБренду.LUX);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[3].Выбрать();
	МассивОшибок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОшибок.Добавить(Выборка.Ошибка + " "+Строка(Выборка.ТипОтношенияКБренду));
	КонецЦикла;
	
	ТаблицаСвободныхЯчеек = РезультатЗапроса[4].Выгрузить();
	ТаблицаСвободныхЯчеек.Индексы.Добавить("Типоразмер");
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НоваяТаблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("ИспользованиеХарактеристик", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыИспользованияХарактеристикНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейкиBabochka"));
	
	Выборка = РезультатЗапроса[6].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСтрокДляУдаления = Новый Массив;
		
		СтрокиЯчеек = ТаблицаСвободныхЯчеек.НайтиСтроки(Новый Структура("Типоразмер", Выборка.Типоразмер));  
		
		Если СтрокиЯчеек.Количество() Тогда
			
			КоличествоРаспределить = Выборка.Количество;
			
			Для каждого СтрокаЯчеек Из СтрокиЯчеек Цикл   
				
				Если КоличествоРаспределить = 0 Тогда
					Прервать;	
				КонецЕсли;
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = Мин(КоличествоРаспределить, СтрокаЯчеек.КоличествоОстаток); 
				НоваяСтрока.Ячейка = СтрокаЯчеек.Ячейка; 
				
				КоличествоРаспределить = КоличествоРаспределить - НоваяСтрока.Количество; 
				
				СтрокаЯчеек.КоличествоОстаток = СтрокаЯчеек.КоличествоОстаток - НоваяСтрока.Количество;
				
				Если СтрокаЯчеек.КоличествоОстаток = 0 Тогда
					МассивСтрокДляУдаления.Добавить(СтрокаЯчеек);	
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоРаспределить > 0 Тогда
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = КоличествоРаспределить; 
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, Количество, ИспользованиеХарактеристик");
			
		КонецЕсли;
		
		Для каждого СтрокаМ Из МассивСтрокДляУдаления Цикл
			ТаблицаСвободныхЯчеек.Удалить(СтрокаМ);	
		КонецЦикла;  
		
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("Товары", НоваяТаблица);
	Результат.Вставить("МассивОшибок",  МассивОшибок);
	
	Возврат Результат;
		
КонецФункции

Функция ЗаполнитьРасходВЯчейки()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаНаПеремещение) Тогда  
		
		НоваяТаблица = ЗаполнитьЯчейкиПоРезервуЗаявки();
		
		Результат = Новый Структура();
		Результат.Вставить("МассивОшибок",  Новый Массив);
		Результат.Вставить("Товары", НоваяТаблица);
		
		Возврат Результат;

	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВТ.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	СУММА(ВТ_Товары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыГруппировка
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыГруппировка.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыГруппировка.Характеристика КАК Характеристика,
		|	ТоварыВЯчейкахBabochkaОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахBabochkaОстатки.ВНаличииОстаток КАК КоличествоОстаток,
		|	ТоварыВЯчейкахBabochkaОстатки.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	ВТ_ТоварыГруппировка КАК ВТ_ТоварыГруппировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейкахBabochka.Остатки(&Период, Ячейка.ТипСкладскойЯчейки = &ТипЯчейкиХранение) КАК ТоварыВЯчейкахBabochkaОстатки
		|		ПО ВТ_ТоварыГруппировка.Номенклатура = ТоварыВЯчейкахBabochkaОстатки.Номенклатура
		|			И ВТ_ТоварыГруппировка.Характеристика = ТоварыВЯчейкахBabochkaОстатки.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыГруппировка.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыГруппировка.Характеристика КАК Характеристика,
		|	ВТ_ТоварыГруппировка.Количество КАК Количество,
		|	ВТ_ТоварыГруппировка.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	ВТ_ТоварыГруппировка КАК ВТ_ТоварыГруппировка";
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Период", Новый МоментВремени(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка));
	Иначе
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипЯчейкиХранение", Перечисления.ТипыСкладскихЯчеек.Хранение);
	Запрос.УстановитьПараметр("ВТ", ЭтотОбъект["ТоварыОтбор"].Выгрузить(,"Номенклатура,Характеристика,Количество"));

	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НоваяТаблица.Колонки.Добавить("ИспользованиеХарактеристик", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыИспользованияХарактеристикНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейкиBabochka"));
	
	МассивОшибок = Новый Массив;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗ_ОстаткиВЯчейках = РезультатЗапроса[2].Выгрузить();   
	ТЗ_ОстаткиВЯчейках.Индексы.Добавить("Номенклатура, Характеристика");
	
	Выборка = РезультатЗапроса[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСтрокДляУдаления = Новый Массив;
		
		СтрокиЯчеек = ТЗ_ОстаткиВЯчейках.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", Выборка.Номенклатура, Выборка.Характеристика));  
		
		Если СтрокиЯчеек.Количество() Тогда
			
			КоличествоРаспределить = Выборка.Количество;
			
			Для каждого СтрокаЯчеек Из СтрокиЯчеек Цикл   
				
				Если КоличествоРаспределить = 0 Тогда
					Прервать;	
				КонецЕсли;
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = Мин(КоличествоРаспределить, СтрокаЯчеек.КоличествоОстаток); 
				НоваяСтрока.Ячейка = СтрокаЯчеек.Ячейка; 
				
				КоличествоРаспределить = КоличествоРаспределить - НоваяСтрока.Количество; 
				
				СтрокаЯчеек.КоличествоОстаток = СтрокаЯчеек.КоличествоОстаток - НоваяСтрока.Количество;
				
				Если СтрокаЯчеек.КоличествоОстаток = 0 Тогда
					МассивСтрокДляУдаления.Добавить(СтрокаЯчеек);	
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоРаспределить > 0 Тогда
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = КоличествоРаспределить; 
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, Количество, ИспользованиеХарактеристик");
			
		КонецЕсли;
		
		Для каждого СтрокаМ Из МассивСтрокДляУдаления Цикл
			ТЗ_ОстаткиВЯчейках.Удалить(СтрокаМ);	
		КонецЦикла;  
		
		
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("Товары", НоваяТаблица);
	Результат.Вставить("МассивОшибок",  МассивОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьЯчейкиПоРезервуЗаявки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВТ.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	СУММА(ВТ_Товары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыГруппировка
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Номенклатура КАК Номенклатура,
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Характеристика КАК Характеристика,
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Ячейка КАК Ячейка,
		|	СУММА(РезервПоЗаявкамНаПеремещениеСЯчейками.Количество) КАК КоличествоОстаток,
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	РегистрСведений.РезервПоЗаявкамНаПеремещениеСЯчейками КАК РезервПоЗаявкамНаПеремещениеСЯчейками
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыГруппировка КАК ВТ_ТоварыГруппировка
		|		ПО РезервПоЗаявкамНаПеремещениеСЯчейками.Номенклатура = ВТ_ТоварыГруппировка.Номенклатура
		|			И РезервПоЗаявкамНаПеремещениеСЯчейками.Характеристика = ВТ_ТоварыГруппировка.Характеристика
		|ГДЕ
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.ЗаявкаНаПеремещение = &ЗаявкаНаПеремещение
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Номенклатура,
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Характеристика,
		|	РезервПоЗаявкамНаПеремещениеСЯчейками.Ячейка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыГруппировка.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыГруппировка.Характеристика КАК Характеристика,
		|	ВТ_ТоварыГруппировка.Количество КАК Количество,
		|	ВТ_ТоварыГруппировка.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	ВТ_ТоварыГруппировка КАК ВТ_ТоварыГруппировка";
	
	Запрос.УстановитьПараметр("ЗаявкаНаПеремещение", ЗаявкаНаПеремещение);
	Запрос.УстановитьПараметр("ВТ", ЭтотОбъект["ТоварыОтбор"].Выгрузить(,"Номенклатура,Характеристика,Количество"));


	//заполнить использование характеристик
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НоваяТаблица.Колонки.Добавить("ИспользованиеХарактеристик", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыИспользованияХарактеристикНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НоваяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейкиBabochka"));
	
	МассивОшибок = Новый Массив;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗ_ОстаткиВЯчейках = РезультатЗапроса[2].Выгрузить();   
	ТЗ_ОстаткиВЯчейках.Индексы.Добавить("Номенклатура, Характеристика");
	
	Выборка = РезультатЗапроса[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСтрокДляУдаления = Новый Массив;
		
		СтрокиЯчеек = ТЗ_ОстаткиВЯчейках.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", Выборка.Номенклатура, Выборка.Характеристика));  
		
		Если СтрокиЯчеек.Количество() Тогда
			
			КоличествоРаспределить = Выборка.Количество;
			
			Для каждого СтрокаЯчеек Из СтрокиЯчеек Цикл   
				
				Если КоличествоРаспределить = 0 Тогда
					Прервать;	
				КонецЕсли;
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = Мин(КоличествоРаспределить, СтрокаЯчеек.КоличествоОстаток); 
				НоваяСтрока.Ячейка = СтрокаЯчеек.Ячейка; 
				
				КоличествоРаспределить = КоличествоРаспределить - НоваяСтрока.Количество; 
				
				СтрокаЯчеек.КоличествоОстаток = СтрокаЯчеек.КоличествоОстаток - НоваяСтрока.Количество;
				
				Если СтрокаЯчеек.КоличествоОстаток = 0 Тогда
					МассивСтрокДляУдаления.Добавить(СтрокаЯчеек);	
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоРаспределить > 0 Тогда
				
				НоваяСтрока = НоваяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, ИспользованиеХарактеристик");
			    НоваяСтрока.Количество = КоличествоРаспределить; 
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, Количество, ИспользованиеХарактеристик");
			
		КонецЕсли;
		
		Для каждого СтрокаМ Из МассивСтрокДляУдаления Цикл
			ТЗ_ОстаткиВЯчейках.Удалить(СтрокаМ);	
		КонецЦикла;         	
		
	КонецЦикла;
	
	Возврат НоваяТаблица;
	
КонецФункции 

&После("ОбработкаЗаполнения")
Процедура ba_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		
		ЗаполнитьПараметрыДокументаПриход(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиКОтбору("Документ.ПриходныйОрдерНаТовары.Товары");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаПриход", АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаПриемки.Получить());
		
		ЭтотОбъект.ТоварыРазмещение.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПеремещение") Тогда
		
		Склад = ДанныеЗаполнения.СкладОтправитель;
		Если НЕ (Склад.АдресныйСклад
			И Склад.ДатаНачалаВеденияУчетаПоЯчейкам < ТекущаяДатаСеанса()) Тогда
			Отказ = Истина;
			ВызватьИсключение "По данной заявки не требуется введение Отбора/Размещения.
			|Для склада не ведется Адресная система.";  
			Возврат;
		КонецЕсли;
		
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Отбор;
		ЭтотОбъект.ЗонаОтгрузки = АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.СкладОтправитель);//Константы.АХ_ЗонаОтгрузки.Получить();
		ЭтотОбъект.Распоряжение = ДанныеЗаполнения;
		ЭтотОбъект.Склад = ДанныеЗаполнения.СкладОтправитель;
		ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Подготовлено;
		ЭтотОбъект.ЭтоРезерв = Истина;
		//ЭтотОбъект.ЗаявкаНаПеремещение = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаЗаявка();
		
		Запрос.УстановитьПараметр("ДокументОснованиеЗаявка", ДанныеЗаполнения);
		
		ЭтотОбъект.ТоварыОтбор.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.ОснованиеЗаявка КАК ОснованиеЗаявка
		|ПОМЕСТИТЬ Заявка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтборРазмещениеТоваровBabochka.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтборРазмещениеТоваровBabochka КАК ОтборРазмещениеТоваровBabochka
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заявка КАК Заявка
		|		ПО ОтборРазмещениеТоваровBabochka.Распоряжение = Заявка.ОснованиеЗаявка
		|ГДЕ
		|	ОтборРазмещениеТоваровBabochka.Проведен
		|	И ОтборРазмещениеТоваровBabochka.ЭтоРезерв
		|	И ОтборРазмещениеТоваровBabochka.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено)";
		
		ПеремещениеРаспоряжение = ДанныеЗаполнения.ТоварыПоРаспоряжениям[0].Распоряжение;
		
		ЭтоРасходникПоЗаявке = Ложь;
		
		Если ТипЗнч(ПеремещениеРаспоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда  
			ОснованиеЗаявка = ПеремещениеРаспоряжение.ОснованиеЗаявка;
			Если ЗначениеЗаполнено(ОснованиеЗаявка) 
				И ОснованиеЗаявка.СкладОтправитель.АдресныйСклад
				И ОснованиеЗаявка.СкладОтправитель.ДатаНачалаВеденияУчетаПоЯчейкам <= НачалоДня(ОснованиеЗаявка.Дата) Тогда
				ЭтоРасходникПоЗаявке = Истина;
				ЭтотОбъект.ЗаявкаНаПеремещение = ОснованиеЗаявка;
				ЭтотОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЭтоРасходникПоЗаявке Тогда
			
			Запрос.УстановитьПараметр("СсылкаПеремещение", ПеремещениеРаспоряжение);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ВызватьИсключение "Не найден документ резерва по Заявке, создание отбора невозможно.";
				Возврат;
			КонецЕсли;   		
			
		КонецЕсли;
		
		ЗаполнитьПараметрыДокументаРасход(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиРасход("Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаРасход", АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад));
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		
		ЭтотОбъект.ТоварыОтбор.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда 
		
		ЗаполнитьПараметрыДокументаПриход(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиКОтбору("Документ.ОприходованиеИзлишковТоваров.Товары");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаПриход", АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаПриемки.Получить());
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		
		ЭтотОбъект.ТоварыРазмещение.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеНедостачТоваров") Тогда 
		
		ЗаполнитьПараметрыДокументаРасход(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиРасход("Документ.СписаниеНедостачТоваров.Товары");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаРасход", АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаОтгрузки.Получить());
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		
		ЭтотОбъект.ТоварыОтбор.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересортицаТоваров") Тогда 
		
		ЗаполнитьПараметрыДокументаПеремещение(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиКОтборуПеремещение("Документ.ПересортицаТоваров.Товары");
		
		Запрос.УстановитьПараметр("Ссылка", 	  ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаПриход", АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаПриемки.Получить());
		Запрос.УстановитьПараметр("ЯчейкаРасход", АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаОтгрузки.Получить());
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ЭтотОбъект.ТоварыРазмещение.Загрузить(РезультатЗапроса[0].Выгрузить());
		ЭтотОбъект.ТоварыОтбор.Загрузить(РезультатЗапроса[1].Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаТоваров") Тогда 
		
		ЗаполнитьПараметрыДокументаПеремещение(ЭтотОбъект, ДанныеЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = АдресноеХранениеBabochka.ПолучитьТекстЗапросаОстаткиКОтборуСборка("Документ.СборкаТоваров.Товары");
		
		Запрос.УстановитьПараметр("Ссылка", 	  ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ЯчейкаПриход", АдресноеХранениеBabochka.ПолучитьЗонуПриемки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаПриемки.Получить());
		Запрос.УстановитьПараметр("ЯчейкаРасход", АдресноеХранениеBabochka.ПолучитьЗонуОтгрузки(ДанныеЗаполнения.Склад));//Константы.АХ_ЗонаОтгрузки.Получить());
		Запрос.УстановитьПараметр("ДокументПартии", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ЭтотОбъект.ТоварыРазмещение.Загрузить(РезультатЗапроса[0].Выгрузить());
		ЭтотОбъект.ТоварыОтбор.Загрузить(РезультатЗапроса[1].Выгрузить());
		
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура ba_ОбработкаУдаленияПроведения(Отказ)
	
	ЕстьДвиженияПослеДокумента = АдресноеХранениеBabochka.ВыполнитьПроверкуЕстьДвиженияПослеДокумента(Ссылка);

	Если ЕстьДвиженияПослеДокумента Тогда
		
		Если Пользователи.ТекущийПользователь() <> Справочники.Пользователи.НайтиПоНаименованию("Лилия") Тогда
			Отказ = Истина;
			Возврат;
		ИначеЕсли Бабочка.ПолучитьЗначениеДинамическихНастроек("ЗапретРаспроведенияПриДвиженииПОЯчейкеАдресныйСклад", Ложь) Тогда     
			Отказ = Истина;
			Возврат; 	
		КонецЕсли;  
		
	КонецЕсли;  
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ЗначениеЗаполнено(ЗаявкаНаПеремещение) Тогда
			АдресноеХранениеBabochka.ВыполнитьОтменуРезерваПоЗаявке(ЗаявкаНаПеремещение, Ссылка);	
		КонецЕсли; 
		
		
		Если ЗначениеЗаполнено(Распоряжение)
			И НЕ ЭтоРезерв Тогда
			
			ЕстьОшибкиНесоответствияТоваровСОснованием = АдресноеХранениеBabochka.ВыполнитьПроверкуНесоответствияТоваровСОснованием(Ссылка);
		
			Если ЕстьОшибкиНесоответствияТоваровСОснованием Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;             
			
		КонецЕсли;
		
		ЕстьОшибки = АдресноеХранениеBabochka.ВыполнитьПроверкуОстатковЯчейки(Ссылка, Движения, Отказ);
		
		Если ЕстьОшибки Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;       

	
		АдресноеХранениеBabochka.ОтразитьТоварыВЯчейкахОтборРазмещение(Ссылка, Движения, Отказ);
		
		Если Ссылка.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено Тогда
			АдресноеХранениеBabochka.ОтразитьОстаткиВЯчейках(Ссылка, Движения, Отказ);
		Иначе
			АдресноеХранениеBabochka.ОчиститьДвиженияОстаткиВЯчейках(Ссылка, Движения, Отказ);
		КонецЕсли;
		
		Если ЭтоРезерв Тогда
			АдресноеХранениеBabochka.ОтразитьРезервПоЗаявкамНаПеремещение(Ссылка, Движения, Отказ);	
		КонецЕсли; 
		
		Движения.Записать();
	
	    ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
	    
		ВызватьИсключение "Не удалось снять резерв и выполнить проведение отбора.";
		
	КонецПопытки;	

КонецПроцедуры
